ihassin/cucumber-wire-tcp2serial/nrf51-rpc-server/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 * @defgroup uart_example_main main.c
 * @{
 * @ingroup uart_example
 * @brief UART Example Application main file.
 *
 * This file contains the source code for a sample application using UART.
 * 
 */

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include "app_uart.h"
#include "app_error.h"
#include "nrf_delay.h"
#include "nrf.h"
#include "bsp.h"

#include "api.h"

#define MAX_TEST_DATA_BYTES     (15U)                /**< max number of test bytes to be used for tx and rx. */
#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 1                           /**< UART RX buffer size. */

void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

void setup_uart()
{
    uint32_t err_code;

    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud38400
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);

    APP_ERROR_CHECK(err_code);

}

int uart_read_byte()
{
    uint8_t chr;
    while(app_uart_get(&chr) != NRF_SUCCESS);
    return(chr);
}

void init_leds()
{
    nrf_gpio_cfg_output(RED);
    nrf_gpio_cfg_output(GREEN);
}

int main(void)
{
    init_leds();

    char command_buffer[UART_TX_BUF_SIZE];
    uint8_t idx = 0;
    uint8_t chr;

    setup_uart();

    command_buffer[0] = 0;
    while (true)
    {
        chr = uart_read_byte();
        if (chr == '\r')
        {
            command_buffer[idx] = 0;
            idx = 0;
            char *ret = api_handler(command_buffer);

            while(app_uart_put(*ret ) != NRF_SUCCESS);
            while(app_uart_put('\n') != NRF_SUCCESS);

        } else if(idx < UART_TX_BUF_SIZE)
        {
            command_buffer[idx++] = chr;
        } else
        {
            command_buffer[0] = 0;
            idx = 0;
            printf("Ignoring overrun\r\n");
        }
    }

}
